<h1>Язык программирования JavaScript: где его используют и почему он популярен</h1>

<h1>Что такое фреймворки и какие они бывают</h1>

<img src="https://cdn2.hexlet.io/derivations/image/fill_webp/1020/480/eyJpZCI6IjFjOGI1MWY5NmRmMTk5YmM3ODhkNmIxNGJmYzJiYjQwLnBuZyIsInN0b3JhZ2UiOiJ5YV9zdG9yZSJ9?signature=b42f856df91431703a8daabcbdf5e21edd92c7a6182e44b9e3037304d0ad6032" width="90%" alt="Картинка 1">

<h1>Фронтенд веб-приложений</h1>

<p>С помощью JavaScript разработчики создают веб-приложения — это программы, которые мы запускаем в браузере. К ним относятся почтовые клиенты, редакторы текста, социальные сети, видеохостинги и многое другое.</p>

<p>На JavaScript создают «внешний интерфейс» веб-приложений — фронтенд. С ним взаимодействует пользователь, нажимая на кнопки, плашки, меню.</p>

<p>На JavaScript написан код для популярных сервисов вроде Google Maps, Google Docs, Netflix, eBay.</p>
    
<h1>Бэкенд веб-приложений</h1>

<p>Кроме интерфейса, который видят пользователи, у веб-приложений есть и внутренняя часть — бэкенд. Это серверная часть приложения, в которой обычно хранятся базы данных.</p>

<p>У JavaScript есть Node.js — это не отдельный язык программирования, а среда исполнения JavaScript-кода на стороне сервера. С ее помощью можно выполнять операции или обращаться к базам данным.</p>

<p>JavaScript в связке с Node.js используют известные компании PayPal и Walmart для взаимодействия со своими серверами.</p>

<img src="https://imgur.com/3hdtlZk.png" width="90%" alt="Картинка 2">

<h1>Расширения для браузера</h1>

<p>Браузерные расширения — это мини-программы, которые состоят из кода, исполняющегося в браузере. Расширения помогают нам блокировать рекламу, включать VPN, скачивать видео или подсчитывать время, проведенное в интернете. И почти все они написаны на JavaScript.</p>

<h1>Мобильные приложения</h1>

<p>На JavaScript также пишут приложения для iOS и Android. Для этого есть специальные фреймворки — готовые наборы кода, «каркас» будущих приложений.</p>

<p>JavaScript-фреймворки вроде React Native помогают адаптировать код под мобильные платформы. Это позволяет создавать кроссплатформенные приложения — работающие и под iOS, и под Android — без необходимости нанимать разработчиков для каждой из этих систем и создавать две версии приложения. На JavaScript написаны мобильные приложения Groupon и LinkedIn.</p>

<h1>Игры</h1>

<p>На JavaScript можно также писать простые игры. Обычно это браузерные бродилки, но иногда встречаются и интересные инди-проекты вроде «2048», PixelDefense, BrowserQuest.</p>

<p>Также существует Unity3d — среда сценариев для игры на основе JavaScript, которая работает вне браузеров.</p>

<h1>Машинное обучение</h1>

<p>Чаще всего в машинном обучении используют другие языки программирования, например Python. Однако иногда для этого применяют и JavaScript. Например, когда создают веб-приложения, включая те, которые визуализируют данные из моделей машинного обучения. Или когда пишут веб-страницу с формой, которая отправляет данные на сервер для обработки моделью машинного обучения.</p>

<p>Также для JavaScript уже написано несколько библиотек, — готовых наборов кода — на основе которых можно создать свою нейросеть. Это, например, Brain.js, Deep playground, Synaptic или FlappyLearning.</p>

p {
    font-family: Georgia, 'Times New Roman', Times, serif;
}

</style>