<h1>Что такое NumPy и зачем он нужен?</h1>

<img src="https://cdn2.hexlet.io/derivations/image/fill_webp/1020/480/eyJpZCI6ImY1NzBhMTE5NGQ0MTFkYjAyZWZmMzQ1MmYwYzc2Njk2LnBuZyIsInN0b3JhZ2UiOiJ5YV9zdG9yZSJ9?signature=a166b506117dc4c15c303d994f155eba70da64863f20a62e0d3d15ac4a0d7d8f" width="90%" alt="Картинка 1">

<p>NumPy — это открытая бесплатная библиотека для Python. Она ускоряет работу с многомерными массивами и матрицами, а также позволяет вычислять много высокоуровневых математических функций при работе с массивами данных. Это упрощает работу аналитика данных, позволяя ему быстро проводить сложные вычисления.</p>

<h1>Зачем аналитику данных NumPy?</h1>

<p>Количество данных постоянно растет: в 2010 году было всего 2 Збайт, в 2020 — более 64 Збайт, а в 2025 этот объем может превысить 180 Збайт. Аналитикам данных приходится работать с весьма объемными массивами. Для этого создали инструменты, которые позволяют быстрее обрабатывать данные или проводить вычисления. Например, одна из первых библиотек для Python, Numeric, всё еще доступна и стабильно работает. Однако она медленно обрабатывает большие данные.</p>

<p>NumPy, или Numerical Python, решает эту задачу: она быстро работает с многомерными массивами. Во-первых, NumPy написана частично на Python (интерпретируемом языке) и частично на C и С++ (компилируемых языках программирования). Последние использовали именно там, где важна скорость, ведь благодаря компиляторам вычисления на C и С++ быстрее, чем на интерпретируемых языках.</p>
    
<p>Во-вторых, NumPy работает только с массивами из однородных элементов, например только с целыми или только с дробными числами. Это позволяет увеличить скорость вычислений до 50 раз и сократить время обработки данных, поскольку аналитику не нужно приводить типы данных к единому виду и обрабатывать их. Еще NumPy работает только с массивами одного типа. Массивы могут быть одномерными, двухмерными, трехмерными и так далее.</p>