<h1>Microsoft добавила GPT-4 Turbo в бесплатную версию Copilot</h1>

<img src="https://habrastorage.org/r/w1560/webt/oi/vw/ag/oivwag3l7cxh-xlw-hhsk4gx9u8.jpeg" width="90%" alt="Картинка 1" />

<p>123456789</p>

<p>987654321</p>

<p>Ранее доступ к GPT-4 Turbo имели только пользователи подписки Copilot Pro, стоимость которой составляет $20 в месяц. Генеральный директор по рекламе и веб-сервисам Microsoft Михаил Парахин поделился, что развёртыванию более производительной ИИ-модели для бесплатного Copilot предшествовало «немало работы».</p>

<p>Дочерняя компания Microsoft, OpenAI, представила GPT-4 Turbo в ноябре прошлого года. Базу модели обновили до апреля 2023 года, а для запросов теперь можно вводить промты до 128 тыс. токенов, что равно примерно 300 страницам. В декабре Microsoft добавила GPT-4 Turbo в Copilot Pro.</p>

<p>По словам Парахина, обладатели Copilot Pro, которые предпочитают использовать более старую GPT-4, могут воспользоваться для этого переключателем.</p>

<p>Ранее Microsoft объявила, что подписчики Copilot Pro получат доступ к конструктору пользовательских ИИ-моделей Copilot GPT Builder. Решение позволяет создавать чат-ботов без каких-либо знаний программирования. Также пользователи Copilot Pro смогут делиться своими моделями даже с теми, у кого нет подписки. Такие чат-боты можно запускать как на мобильных устройствах, так и на ПК.</p>

<p>В рамках последней презентации Samsung показала новые возможности Copilot в Windows 11 до официального анонса со стороны Microsoft. Изображения на сайте южнокорейской компании подтверждают слухи о реализации идеи использования естественного языка при общении с ИИ для различных задач. Например, это включает напоминания о сказанном другими пользователями в чате, возможность скопировать ссылку или другие данные из сообщения пользователя в чате, отвечать на определённые слова в чате определёнными сообщениями и другие опции.</p>

<style>

    p {
        font-family: Georgia, 'Times New Roman', Times, serif;
        font-size: 20px;
    }
    
    </style>