<h1>«Яндекс Маркет» представил новую модель складского робота со встроенной нейросетью</h1>

<img src="https://habrastorage.org/getpro/habr/upload_files/61c/1b4/b73/61c1b4b734ef33a6546e5ef33001d413.jpg" width="90%" alt="Картинка 1" />

<p>«Яндекс Маркет» начал использовать на своём Cуперскладе (Софьино-2) новую модель складского робота — «Роборуку». С её помощью сервис планирует решать разные задачи: от разгрузки прибывшей партии товаров до их подготовки к отправке покупателям. «Роборука» поможет ускорить складские процессы и повысить качество их выполнения, а также избавит сотрудников от монотонной работы.</p>

<p>В нового робота встроена самообучающаяся нейросеть «Яндекса». Разработчики компании обучают её сравнивать любые предметы между собой, обобщать информацию о них и применять эти знания в разных обстоятельствах. Это называется робастность — способность модели машинного обучения сохранять качество работы при изменении входных данных.</p>

<p>Например, если «Роборука» умеет брать письменную ручку, то сможет взять и карандаш или кисть, с которыми раньше никогда не имела дело. Это позволяет роботу взаимодействовать с новыми для него предметами без дополнительного обучения — и значит, выполнять множество складских задач на разных этапах.</p>

<p>Сейчас «Маркет» тестирует «Роборуку»: она поднимает с конвейера коробки разных размеров, форм, веса и раскладывает на соответствующие палеты, и наоборот, — разбирает их. С «Роборукой» скорость сборки одной палеты в среднем увеличивается в два раза. Благодаря этому сервис сможет быстрее принимать и обрабатывать на складе товары от продавцов, а покупатели будут быстрее получать заказы.</p>

<p>В будущем робота планируют использовать для сортировки товаров перед их упаковкой: «Роборука» будет брать небольшие вещи, например помаду, джинсы или авторучку, и класть в коробку, которую затем отправят покупателю.</p>

<style>

    p {
        font-family: Georgia, 'Times New Roman', Times, serif;
        font-size: 20px;
    }
    
    </style>