<h1>Cognition представила нейросеть Devin, которая умеет осуществлять полный цикл разработки ПО вместо инженера-программиста</h1>

<img src="https://habrastorage.org/r/w1560/webt/pz/q6/5b/pzq65bar9egwyq7j6xonh29rk50.png" width="90%" alt="Картинка 1" />

<p>Американский стартап Cognition представил нейросеть под названием Devin. В компании утверждают, что этот проект способен более самостоятельно осуществлять полный цикл разработки ПО и даже заменить инженера-программиста.</p>

<p>Разработчики рассказали, что нейрорешение Devin обучено рассуждать, самостоятельно планировать и реализовывать проекты в области написания ПО, принимать по мере их выполнения различные решения. Также ИИ проекта не только обучается, но и исправляет допущенные ошибки и ориентируется в контексте.</p>

<p>Cognition оценили Devin по SWE-Bench бенчмарку и выяснили, что он решает 13.86% всех задач без какой-либо помощи. Этот показатель превосходит другие передовые модели ИИ-помощников программистов, которые в этом тесте в среднем получают 1.96% без помощи и 4.80% с помощью человека.</p>

<p>Cognition снабдила Devin необходимыми инструментами разработчика для органичной интеграции в существующей рабочие процессы. Согласно пояснению Cognition, основные возможности нейросети Devin включают в себя:</p>

<ul>
    <li>комплексную разработку приложений — создание и развёртывание полнофункциональных веб-приложений, добавление новых опций в проект по мере поступления отзывов от пользователей;</li>
    <li>адаптацию к новым технологиям — освоение незнакомых инструментов с помощью чтения документации;</li>
    <li>обучение ИИ — установка и настройка больших языковых моделей на основе инструкций из различных открытых репозиториев;</li>
    <li>автономное обнаружение ошибок — выявление, исправление и отлаживание проблем в коде. В этом случае Devin выступает полноценным участником в разработке проектов;</li>
    <li>умение самостоятельно решать программные задачи по веб-разработке и другим направлениям на различных биржах фриланса, включая Upwork.</li>
</ul>

<p>Доступ к Devin в Cognition предоставляют по запросу и пока что только ограниченному числу пользователей. У ИИ-системы есть отдельный чат, через который Devin общается с пользователем и раскрывает все свои действия. Также у проекта есть консоль, благодаря которой Devin скачивает файлы, отправляет запросы и прочие сетевые и программные задачи. Дополнительно пользователю доступен редактор, в котором виден написанный ИИ код, а также браузер, где Devin может открывать самостоятельно сайты и показывать результаты своей работы.</p>

<p>Журналисты из Bloomberg протестировали нейросеть от Cognition и пояснили, что Devin способен делать намного больше, чем другие ИИ-помощники программистов. Например, по текстовому запросу нейросеть сделала полноценный сайт-каталог с ресторанами Сиднея.</p>

<p>Эксперты отрасли пояснили СМИ, что Devin является мощным и прогрессивным инструментом, но едва ли он вытеснит потребность в живых специалистах и разработчиках в IT-отрасли.</p>

<style>

    p {
        font-family: Georgia, 'Times New Roman', Times, serif;
        font-size: 20px;
    }
    
    </style>