<h1>Что такое фреймворки и какие они бывают</h1>

<img src="https://cdn2.hexlet.io/derivations/image/fill_webp/1020/480/eyJpZCI6IjU4ZjIyMmI5N2FlMWZiNGY3N2U2YmNiODA1NjZjYTE4LnBuZyIsInN0b3JhZ2UiOiJ5YV9zdG9yZSJ9?signature=395cfaca84e17d491df7e837d1222d3a57675d3462f41d56b8b4f93034314014" width="90%" alt="Картинка 1">

<h1>Что такое фреймворк?</h1>

<p>Создавая сайт, разработчики могут писать код с нуля сами: сделать скелет будущей страницы на HTML, стилизовать с помощью CSS. А могут воспользоваться наборами уже готового кода — библиотеками — для создания отдельных элементов сайта вроде блоков с иллюстрациями, текстами.</p>

<p>Но если их задача создать что-то сложнее сайтов, например веб-приложение, как соцсеть ВКонтакте — понадобится фреймворк, так будет быстрее и удобнее.</p>

<p>Например, фреймворки для фронтенда задают каркас будущего приложения, который состоит из компонентов. Компонент — как кирпичик для строительства веб-сайтов. Это маленькая часть кода, которая, например, добавляет на сайт кнопку или поле для ввода текста. Вы можете комбинировать вместе множество таких компонентов, чтобы создать большое и сложное веб-приложение, как конструктор из деталей LEGO.</p>
    
<img src="https://imgur.com/3u7Kjlp.png" width="90%" alt="Картинка 2">

<h1>В чем разница между фреймворком и библиотекой?</h1>

<p>Фреймворк — это как большая библиотека. Она решает не одну проблему в разработке веб-приложения, а сразу несколько. Например, упрощает верстку и стилизацию с помощью компонентного подхода, упрощает управление данными внутри приложения, предлагает свой способ взаимодействия между клиентом и сервером — то есть решает вообще все основные проблемы. При этом, чтобы пользоваться фреймворком, можно не устанавливать отдельные библиотеки.</p>

<img src="https://imgur.com/cfinAdG.png" width="90%" alt="Картинка 3">

<h1>Из чего состоят фреймворки?</h1>

<p>Большинство фреймворков основано на шаблоне проектирования MVC (Model-View-Controller или модель-представление-контроллер).</p>

<p><b>Модель (Model)</b> — это место, где хранятся данные вашего приложения. Представим, что мы пришли в музей. Карта музея с описанием, где и в каком зале находится тот или иной экспонат, — это и есть модель.</p>

<p><b>Представление или отображение (View)</b> определяет взаимодействие с пользователем через модель. Он отвечает за отображение данных, определяет внешний вид проекта — веб-сайтов или приложений. От него зависят возможные действия пользователя: где печатать текст, какие кнопки нажимать.</p>

<p><b>Контроллер (Controller)</b> отвечает за реакцию двух предыдущих объектов на действия пользователя. Его код и логика проверяют, как сайт обрабатывает запросы и выдает ли правильный результат.</p>

<style>

    p {
        font-family: Georgia, 'Times New Roman', Times, serif;
    }
    
    </style>