<h1>Apple начала собирать в Бразилии базовую модель линейки iPhone 15</h1>

<img src="https://habrastorage.org/r/w1560/webt/bx/y0/yz/bxy0yzrbqh7yajoyddd46ohbcjy.jpeg" width="90%" alt="Картинка 1">

<p>О начале сборки iPhone 15 сообщил бразильский портал MacMagazine. Apple не подтвердила эту информацию на своём сайте. Однако интернет-магазин компании в Бразилии даёт покупателям возможность проверить, какую модель они приобретают.</p>

<p>На это указывают URL-адреса страницы оформления заказа iPhone 15. Покупатели могут увидеть номер изделия, заканчивающийся на «BR/A», который используется для идентификации продукции, собранной в Бразилии. Большинство товаров имеют маркировку «BE/A» или «BZ/A», указывающие на то, что продукция импортирована для продажи в Бразилии.</p>

<p>Как было с предыдущими итерациями iPhone, Apple решила производить в латиноамериканской стране именно базовую модель. Все iPhone 15 Plus, iPhone 15 Pro и iPhone 15 Pro Max, продаваемые в Бразилии, импортированы из других стран.</p>

<p>Страна повысила налоги на ввозимые товары, поэтому некоторые компании инвестировали в сборку своей продукции в Бразилии, что обеспечивает снижение налоговой нагрузки на продажу устройств. На старте продаж iPhone 15 с 128 ГБ стоил в Бразилии около $1,46 тыс., однако сейчас модель можно найти за $1,08 тыс. в некоторых розничных магазинах.</p>

<p>В последние годы Apple стремится диверсифицировать производство iPhone и другой своей продукции за пределами Китая. Наличие сборочных мощностей в других регионах может помочь компании избежать проблем с поставками на местные рынки и снизить зависимость от КНР.</p>

<p>Помимо Бразилии, Apple также наладила производство гаджетов в Индии и Вьетнаме. Корпорация впервые запустила выпуск iPhone 15 на заводах в Индии одновременно с китайскими предприятиями.</p>