<h1>Облачный провайдер Serverspace запустил продажи в Бразилии</h1>

<img src="https://habrastorage.org/r/w1560/webt/bs/lt/c8/bsltc8oxgreza4urldxl-edxocs.png" width="90%" alt="Картинка 1" />

<p>Для пользователей доступны</p>

<ol>
    <li>Веб-сайт с доменом Serverspace.com.br;</li>
    <li>Прием платежей в панели управления по картам местных банков в бразильских реалах;</li>
    <li>Техническая поддержка в чате на сайте, в панели управления и по телефону: + 55 11 5118-1047;</li>
    <li>Дата-центры во всех доступных в Serverspace локациях, а также в Сан-Паулу – Equinix SP3.</li>
</ol>

<h1>Дата-центр в Бразилии</h1>

<p>Недавно наши специалисты разместили оборудование в передовом дата-центре Equinix SP3 в Сан-Паулу. В ДЦ были установлены серверы модели vStack SL201-25RE, которые оборудованы последними 16-ядерными процессорами Intel Xeon Gold 6226R, выполненными по технологии Cascade Lake и имеющими тактовую частоту 2.70 ГГц.</p>

<p>Открывая офис в Бразилии, Serverspace стремится к дальнейшему расширению своего присутствия в регионах мира. Главная задача – предоставить еще большему числу пользователей доступ к облачным сервисам, которые адаптированы к особенностям различных рынков. В планах компании: открытие представительства в Объединенных Арабских Эмиратах.</p>

<h1>Как развернуть облачный сервер в Serverspace?</h1>

<ol>
    <li>Зарегистрируйтесь в панели управления на сайте Serverspace;</li>
    <li>Выберите vStack cloud или VMware cloud в зависимости от платформы виртуализации, которую вы будете использовать;</li>
    <li>Начните создание сервера: выберите ОС, локацию дата-центра и ресурсы сервера;</li>
    <li>Нажмите кнопку «Создать сервер».</li>
</ol>

<p>После пополнения баланса сервер будет создан автоматически.</p>

<style>

    p {
        font-family: Georgia, 'Times New Roman', Times, serif;
        font-size: 20px;
    }
    
    </style>